In [1]:
import numpy as np
import pandas as pd

In [2]:
salaryDict = {"Name" : ["A","B","C","D"],
              "Department" : ["Software", "Software", "Sales", "HR"],
              "Salary" : [1000,2000,3000,4000] }

In [3]:
salaryDataFrame = pd.DataFrame(salaryDict)

In [4]:
salaryDataFrame

  Name Department  Salary
0    A   Software    1000
1    B   Software    2000
2    C      Sales    3000
3    D         HR    4000

In [5]:
salaryDataFrame["Department"]

0    Software
1    Software
2       Sales
3          HR
Name: Department, dtype: object

In [6]:
salaryDataFrame["Department"].unique()

array(['Software', 'Sales', 'HR'], dtype=object)

In [7]:
salaryDataFrame["Department"].nunique()

3

**nunique = number of unique**

In [8]:
salaryDataFrame["Department"].value_counts()

Software    2
Sales       1
HR          1
Name: Department, dtype: int64

In [9]:
def calculateSalary(salary):
    return salary * 0.66

salaryDataFrame["Salary"].apply(calculateSalary)

0     660.0
1    1320.0
2    1980.0
3    2640.0
Name: Salary, dtype: float64

In [10]:
salaryDataFrame.isnull()

    Name  Department  Salary
0  False       False   False
1  False       False   False
2  False       False   False
3  False       False   False

In [20]:
newData = {"Character Class" : ["South Park","South Park","Simpson","Simpson","Simpson"],
           "Name" : ["Cartman","Kenny","Homer","Bart","Bart"],
           "ID" : [1,2,3,4,5]
}

In [21]:
newDataFrame = pd.DataFrame(newData)

In [22]:
newDataFrame

  Character Class     Name  ID
0      South Park  Cartman   1
1      South Park    Kenny   2
2         Simpson    Homer   3
3         Simpson     Bart   4
4         Simpson     Bart   5

**aggfunc aynı isim vb sahip verilerin sayısal kısmına matematiksel işlem yapmayı sağlar.**

In [24]:
newDataFrame.pivot_table(values = "ID", index = ["Character Class", "Name"], aggfunc = np.sum)

                         ID
Character Class Name
Simpson         Bart      9
                Homer     3
South Park      Cartman   1
                Kenny     2